<template>

    <h2>## About</h2>

    <section class="sec-2">
        <p>制作者：むずでょ</p>
        <p>ワラベンチャーでは、Ｗｅｂとデスクトップで両用できるアプリケーションを開発していっているぜ（＾▽＾）！</p>
        <br/>

        <p>開発ツール</p>
        <br/>

        <p>お絵描きツール</p>
        <br/>

        <p>Windows Paint ... Windows 11 に付いてくる。</p>
        <p>GIMP 3 ... 無料。</p>
        <p>Aseprite ... $19.99 USD。日本円で 2950円ぐらいした。</p>
        <br/>

        <p>開発環境の構成</p>
        <br/>

        <p>環境１</p>
        <p>フロントエンド： Vue 3, Vuetify 3</p>
        <p>バックエンド： Tauri 2</p>
        <p>ホスト： Takahashi-PC（ローカルＰＣ）</p>
        <p>ＯＳ： Windows 11</p>
        <br/>

        <p>環境２</p>
        <p>フロントエンド： Vue3, Vuetify3</p>
        <p>バックエンド： Nuxt 2</p>
        <p>ホスト： Takahashi-PC（ローカルＰＣ）</p>
        <p>ＯＳ： Windows 11</p>
        <br/>

        <p>環境３</p>
        <p>フロントエンド： Vue3, Vuetify3</p>
        <p>バックエンド： Nuxt 2</p>
        <p>ホスト： ****（さくらのVPS）</p>
        <p>ＯＳ： Ubuntu</p>
        <br/>

        <p>まず環境１でデスクトップアプリを作り、次に環境２のＷｅｂアプリへ移植し、最終的に環境３のサーバーにデプロイするんだぜ（＾▽＾）！</p>
        <p>このとき、環境１と環境２の間、環境２と環境３の間では、単純なコピー貼り付けとはいかないので、なるべく３者の違いを小さくするべく３者の間を取ったような協した仕様にし、手で１つ１つ移植するぜ（＾～＾）</p>
        <p>このとき、Nuxt 2 はべつに Tauri 専用ではないし、Tauri はべつに Nuxt 2 専用ではないから、どちらかが折れてシステム全体を効率的に１つに統合させる、といったことはできないぜ。必ず文化の違いが衝突する。</p>
        <p>そのときの妥協点が、工夫だな（＾～＾）</p>
        <hr/>
        <router-link to="/">ホームに戻る</router-link>
    </section>

</template>
